Revit 2015 API
EnergyAnalysisDetailModel Properties
The EnergyAnalysisDetailModel type exposes the following members.
Properties
Name | Description
ExportMullions
 Indicates if to specify the setting for exporting mullions.
IncludeShadingSurfaces
 Indicates if to set and get the setting for if shading surfaces should be included.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
SimplifyCurtainSystems
 Indicates if to specify the setting for simplified curtain systems.
Tier
 Level of computation for energy analysis model.
See Also
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace